# Настройки для алгоритма стеганографии
DEGREE = -1  # Количество младших бит, отдаваемых LSB
FRAME_START = -1  # SPIN_N
FRAME_COUNT = -1  # SPIN_I
OUTPUT_DIR = ''  # Выходной каталог
FAST_DEC = False

COPYRIGHT = ''

# Данные о видео файле
F_OWNER = ''  # Владелец видео файла
F_NAME = ''  # Имя видео файла
F_DATE_CREATE = ''  # Дата создания видео файла
F_DATE_MODIFY = ''  # Дата модификации видео файла

# Данные о пользоваетеле
U_FNAME = ''  # Имя пользователя
U_SNAME = ''  # Фамилия пользователя
U_LNAME = ''  # Отчество пользователя
U_EMAIL = ''  # Эл. почта пользователя
